Revit 2024 API
BoundaryConditions.GetDegreesOfFreedomCoordinateSystem Method
 Gets the origin and rotation of coordinate system that is used by translation and rotation parameters, like X Translation or Z Rotation.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public Transform GetDegreesOfFreedomCoordinateSystem()
Visual Basic
Public Function GetDegreesOfFreedomCoordinateSystem As Transform
Visual C++
public:
Transform^ GetDegreesOfFreedomCoordinateSystem()
Return Value
 The coordinate system. Origin contains the position of the start of the boundary conditions. BasisX, BasisY and BasisZ contain the directions of the axes in the global coordinate system.
See Also
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace